**Programming for Data Analytics Assesment (CA - 2)**

Google Colab is use for all problems 

Name : Jayant Patel   
Student No : 10559429

In [ ]:
# Connection with google drive 
from google.colab import drive
drive.mount('/content/drive')

In [73]:
# Inserting data into dataframe 
import pandas as pd
path="/content/drive/MyDrive/Python Assessment /FireBrigadeAndAmbulanceCallOuts.csv"
df=pd.read_csv(path)
# Displying Data 
display(df)

             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38551  28/04/2018  Blanchardstown    Fire ALARM  ...       NaN  00:20:00  00:40:00
38552  09/10/2018      Kilbarrack      Fire CAR  ...       NaN  00:20:00  00:40:00
38553  07/06/2018        Skerries    Fire SMALL  ...       NaN         -         -
38554  21/11/2018      Donnybrook    Fire ALARM  ...       NaN         -         -
38555  01/01/2019      Kilbarrack    Fire ALARM  ...       NaN         -         -

[38556 rows x 11 columns]

In [74]:
## Output the total number of rows and columns ##

# fetching the number of rows and columns
rows = df.shape[0]
cols = df.shape[1]
  
# displaying the number of rows and columns
print("Rows: " + str(rows))
print("Columns: " + str(cols))

Rows: 38556
Columns: 11

In [75]:
# Count of not null value 
print("Output the number of non-null rows (by column)")
Not_Null= df.notnull().sum()
print(Not_Null)

# Count of null value 
print("\nOutput the number of null values (by column)")
Null = df.isnull().sum()
print(Null)
# Count of all null value 
print("\nOutput the number of null values for all columns")
All_Null=df.isnull().sum().sum()
print(All_Null)

Output the number of non-null rows (by column)
Date            38556
Station Area    38556
Description     38556
TOC             38556
ORD             38556
MOB             37311
IA              30962
LS              38556
AH                153
MAV             38530
CD              38530
dtype: int64

Output the number of null values (by column)
Date                0
Station Area        0
Description         0
TOC                 0
ORD                 0
MOB              1245
IA               7594
LS                  0
AH              38403
MAV                26
CD                 26
dtype: int64

Output the number of null values for all columns
47294

In [76]:
# Output the total number of call outs by Station Area
Station_Area=df['Station Area'].value_counts()
print(Station_Area)

Tallaght          6525
Dolphins Barn     4018
Tara St           3600
Kilbarrack        3548
Dun Laoghaire     3271
Phibsborough      3160
Finglas           3030
Swords            2614
Rathfarnham       2129
Blanchardstown    2089
Donnybrook        1787
North Strand      1645
Balbriggan         688
Skerries           449
Dunshaughlin         2
MH14                 1
Name: Station Area, dtype: int64

In [77]:
# Output the total number of call outs by Date and Station Area
Date_Station=df.groupby(['Date', 'Station Area'])['Station Area'].count()
print(Date_Station)

Date        Station Area
01/01/2013  Balbriggan        3
            Blanchardstown    1
            Dolphins Barn     4
            Donnybrook        1
            Dun Laoghaire     3
                             ..
31/12/2015  Donnybrook        1
            Dun Laoghaire     1
            Finglas           3
            North Strand      1
            Tallaght          5
Name: Station Area, Length: 12483, dtype: int64

In [78]:
#Output the total number of call outs by Station Area and Date where 
#the description is either Fire Car or Fire Alarm.

Date_Desc=df.where((df['Description']=='Fire CAR') | (df['Description']=='Fire ALARM'))
Date_Desc.dropna(inplace=True)
print(Date_Desc.groupby(['Date', 'Description', 'Station Area'])[["Station Area"]].count())

                                       Station Area
Date       Description Station Area
01/01/2013 Fire ALARM  Balbriggan                 1
                       Dun Laoghaire              1
                       Kilbarrack                 1
                       Tallaght                   1
           Fire CAR    Balbriggan                 1
                       Blanchardstown             1
                       Kilbarrack                 1
                       Tallaght                   3
02/01/2013 Fire ALARM  Dolphins Barn              1
                       Finglas                    1
                       Swords                     1
           Fire CAR    Finglas                    1
                       Tallaght                   1
03/01/2013 Fire ALARM  Donnybrook                 2
                       Finglas                    1
                       North Strand               1
                       Phibsborough               1
                       Swords                     1
                       Tara St                    1
           Fire CAR    Dolphins Barn              1
05/01/2013 Fire ALARM  Donnybrook                 1
                       Dun Laoghaire              1
                       Kilbarrack                 1
                       Phibsborough               1
           Fire CAR    North Strand               1
                       Tallaght                   1
06/01/2013 Fire CAR    Blanchardstown             1

In [79]:
# Replace any instance of “,” (in any column) with an empty string.
# Count of  "," in each column
print("\nCount of ',' in each colum ") 
print((df == ",").sum(axis=0))
# Replacing value of , in all coloum because "," is present in more than one column
df.replace({",": " "}, inplace=True)
# Checking again Count of "," in each colum
print("\nChecking again Count of ',' in each colum ") 
print((df == ",").sum(axis=0))

Count of ',' in each colum
Date            0
Station Area    0
Description     0
TOC             0
ORD             0
MOB             0
IA              0
LS              0
AH              5
MAV             9
CD              9
dtype: int64

Checking again Count of ',' in each colum
Date            0
Station Area    0
Description     0
TOC             0
ORD             0
MOB             0
IA              0
LS              0
AH              0
MAV             0
CD              0
dtype: int64

In [80]:
# Replace any instance of “-” (in any column) with an empty string.
# Count of  "-" in each column
print("\nCount of '-' in each colum ")
print((df == "-").sum(axis=0))
# Replacing value of "-" in all coloum because "-" is present in more than one column
df.replace({"-": " "}, inplace=True)
# Checking again Count of "-" in each colum 
print("\nChecking again Count of '-' in each colum ") 
print((df == "-").sum(axis=0))

df

Count of '-' in each colum
Date            0
Station Area    0
Description     0
TOC             0
ORD             0
MOB             0
IA              0
LS              0
AH              0
MAV             3
CD              3
dtype: int64

Checking again Count of '-' in each colum
Date            0
Station Area    0
Description     0
TOC             0
ORD             0
MOB             0
IA              0
LS              0
AH              0
MAV             0
CD              0
dtype: int64

             Date    Station Area   Description  ...        AH       MAV        CD
0      01/01/2013     Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1      01/01/2013        Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2      01/01/2013    North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3      01/01/2013        Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4      01/01/2013         Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47
...           ...             ...           ...  ...       ...       ...       ...
38551  28/04/2018  Blanchardstown    Fire ALARM  ...       NaN  00:20:00  00:40:00
38552  09/10/2018      Kilbarrack      Fire CAR  ...       NaN  00:20:00  00:40:00
38553  07/06/2018        Skerries    Fire SMALL  ...       NaN
38554  21/11/2018      Donnybrook    Fire ALARM  ...       NaN
38555  01/01/2019      Kilbarrack    Fire ALARM  ...       NaN

[38556 rows x 11 columns]

In [81]:
# Drop rows for the columns (AH, MAV, CD) where at least one row value is NULL.

df.dropna(subset=['CD','MAV','AH'], inplace=True)

In [82]:
# To delete all duplicate value 

df.drop_duplicates(inplace=True)
df.shape

(152, 11)

In [83]:
# Output the minimum time difference between TOC and ORD.
import datetime
print((pd.to_datetime(df.ORD, format='%H:%M:%S') - pd.to_datetime(df.TOC, format='%H:%M:%S')).min())

0 days 00:00:30

**Azure Connection and inserting final CSV file**

In [ ]:
!pip install pypyodbc
import pypyodbc

In [106]:
%%sh
curl https://packages.microsoft.com/keys/microsoft.asc | apt-key add -
curl https://packages.microsoft.com/config/ubuntu/16.04/prod.list > /etc/apt/sources.list.d/mssql-release.list
sudo apt-get update
sudo ACCEPT_EULA=Y apt-get -q -y install msodbcsql17

OK
Ign:1 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  InRelease
Hit:2 https://cloud.r-project.org/bin/linux/ubuntu bionic-cran40/ InRelease
Ign:3 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  InRelease
Hit:4 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  Release
Hit:5 https://packages.microsoft.com/ubuntu/16.04/prod xenial InRelease
Hit:6 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  Release
Get:7 http://security.ubuntu.com/ubuntu bionic-security InRelease [88.7 kB]
Hit:9 http://archive.ubuntu.com/ubuntu bionic InRelease
Hit:10 http://ppa.launchpad.net/c2d4u.team/c2d4u4.0+/ubuntu bionic InRelease
Get:12 http://archive.ubuntu.com/ubuntu bionic-updates InRelease [88.7 kB]
Hit:13 http://ppa.launchpad.net/cran/libgit2/ubuntu bionic InRelease
Hit:14 http://ppa.launchpad.net/deadsnakes/ppa/ubuntu bionic InRelease
Get:15 http://archive.ubuntu.com/ubuntu bionic-backports InRelease [74.6 kB]
Hit:16 http://ppa.launchpad.net/graphics-drivers/ppa/ubuntu bionic InRelease
Fetched 252 kB in 1s (189 kB/s)
Reading package lists...
Reading package lists...
Building dependency tree...
Reading state information...
msodbcsql17 is already the newest version (17.7.2.1-1).
The following package was automatically installed and is no longer required:
  libnvidia-common-460
Use 'sudo apt autoremove' to remove it.
0 upgraded, 0 newly installed, 0 to remove and 36 not upgraded.

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0Warning: apt-key output should not be parsed (stdout is not a terminal)
100   983  100   983    0     0   2960      0 --:--:-- --:--:-- --:--:--  2960
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    79  100    79    0     0    951      0 --:--:-- --:--:-- --:--:--   951

In [107]:
#Establishing connection
connection = pypyodbc.connect('Driver={ODBC Driver 17 for SQL Server};Server=tcp:jayant.database.windows.net,1433;Database=FireBrigade;Uid=jayant;Pwd=dbs@10559429;Encrypt=yes;TrustServerCertificate=no;Connection Timeout=30;')

In [108]:
cursor=connection.cursor()

In [111]:
# Removing space in colum name 
df_new = df.rename(columns={'Station Area': 'Station_Area'})
cursor=connection.cursor()
df_new = df_new.fillna(value='')
# Inserting data in sql database 
for index, row in df_new.iterrows():
  Values = [row.Date,row.Station_Area,row.Description,row.TOC,row.ORD,row.MOB,row.IA,row.LS,row.AH,row.MAV,row.CD]
  cursor.execute("INSERT INTO FireBrigade (Date,Station_Area,Description,TOC,ORD,MOB,IA,LS,AH,MAV,CD) values(?,?,?,?,?,?,?,?,?,?,?)", Values)
connection.commit()
cursor.close()

**Test 1**

In [112]:
#   Output the total number of callout by station area
print("### Using SQL ###")
sql1 = "SELECT Station_Area,COUNT(*) as callout FROM FireBrigade group by Station_Area order by callout desc;"
print(pd.read_sql(sql1, connection))

print("### Using Pandas ###")
test1=df_new['Station_Area'].value_counts()
print(test1)

### Using SQL ###
      station_area  callout
0         Tallaght       30
1    Dun Laoghaire       21
2       Kilbarrack       17
3    Dolphins Barn       15
4          Finglas       12
5       Donnybrook        9
6          Tara St        9
7     Phibsborough        9
8           Swords        8
9   Blanchardstown        6
10      Balbriggan        5
11    North Strand        5
12     Rathfarnham        5
13        Skerries        1
### Using Pandas ###
Tallaght          30
Dun Laoghaire     21
Kilbarrack        17
Dolphins Barn     15
Finglas           12
Phibsborough       9
Tara St            9
Donnybrook         9
Swords             8
Blanchardstown     6
Rathfarnham        5
Balbriggan         5
North Strand       5
Skerries           1
Name: Station_Area, dtype: int64

**Test 2**

In [118]:
# Output the total number of call outs by Date and Station Area.(first 10 value)
print("### Using SQL ###")
sql2 = "SELECT top 10 date,Station_Area,COUNT(*) as callout FROM FireBrigade group by Station_Area,date;"
print(pd.read_sql(sql2, connection))

print("### Using Pandas ###")
test2=df_new.groupby(['Date', 'Station_Area'])['Station_Area'].count()
print(test2.head(10))

### Using SQL ###
         date    station_area  callout
0  01/01/2013      Balbriggan        3
1  01/01/2013  Blanchardstown        1
2  01/01/2013   Dolphins Barn        4
3  01/01/2013      Donnybrook        1
4  01/01/2013   Dun Laoghaire        3
5  01/01/2013         Finglas        2
6  01/01/2013      Kilbarrack        4
7  01/01/2013    North Strand        1
8  01/01/2013    Phibsborough        1
9  01/01/2013     Rathfarnham        1
### Using Pandas ###
Date        Station_Area
01/01/2013  Balbriggan        3
            Blanchardstown    1
            Dolphins Barn     4
            Donnybrook        1
            Dun Laoghaire     3
            Finglas           2
            Kilbarrack        4
            North Strand      1
            Phibsborough      1
            Rathfarnham       1
Name: Station_Area, dtype: int64

**Test 3**

In [119]:
# Output the total number of call outs by Station Area and Date where the description is either Fire Car or Fire Alarm.(first 10 value)
print("### Using SQL ###")
sql3 = "SELECT top 10 date,description,Station_Area,COUNT(*) as callout FROM FireBrigade where description ='Fire CAR' or  description ='Fire ALARM ' group by date,description,Station_Area;"
print(pd.read_sql(sql3, connection))

print("### Using Pandas ###")
test3=df_new.where((df_new['Description']=='Fire CAR') | (df_new['Description']=='Fire ALARM'))
test3.dropna(inplace=True)
test3=test3.groupby(['Date', 'Description', 'Station_Area'])[["Station_Area"]].count()
print(test3.head(10))

### Using SQL ###
         date description    station_area  callout
0  01/01/2013  Fire ALARM      Balbriggan        2
1  01/01/2013  Fire ALARM   Dun Laoghaire        1
2  01/01/2013  Fire ALARM      Kilbarrack        1
3  01/01/2013  Fire ALARM        Tallaght        1
4  01/01/2013  Fire ALARM         Tara St        1
5  01/01/2013    Fire CAR      Balbriggan        1
6  01/01/2013    Fire CAR  Blanchardstown        1
7  01/01/2013    Fire CAR      Kilbarrack        1
8  01/01/2013    Fire CAR        Tallaght        3
9  02/01/2013  Fire ALARM   Dolphins Barn        1
### Using Pandas ###
                                       Station_Area
Date       Description Station_Area
01/01/2013 Fire ALARM  Balbriggan                 2
                       Dun Laoghaire              1
                       Kilbarrack                 1
                       Tallaght                   1
                       Tara St                    1
           Fire CAR    Balbriggan                 1
                       Blanchardstown             1
                       Kilbarrack                 1
                       Tallaght                   3
02/01/2013 Fire ALARM  Dolphins Barn              1

**Test 4**

In [93]:
# Count of ',' in each colum 
print("##################### Using SQL ##################")
sql4 = "select * from dbo.FireBrigade where Date LIKE ',' OR Station_Area LIKE ',' OR Description LIKE ',' OR TOC LIKE ',' OR ORD LIKE ',' OR MOB LIKE ',' OR IA LIKE ',' OR LS LIKE ',' OR AH LIKE ',' OR MAV LIKE ',' OR CD LIKE ','"
print(pd.read_sql(sql4, connection))

print("##################### Using Pandas ##################")
print((df_new == ",").sum())

##################### Using SQL ##################
Empty DataFrame
Columns: [date, station_area, description, toc, ord, mob, ia, ls, ah, mav, cd]
Index: []
##################### Using Pandas ##################
Date            0
Station_Area    0
Description     0
TOC             0
ORD             0
MOB             0
IA              0
LS              0
AH              0
MAV             0
CD              0
dtype: int64

**Test 5**

In [94]:
# Count of '-' in each colum 
print("##################### Using SQL ##################")
sql5 = "select * from dbo.FireBrigade where Date LIKE '-' OR Station_Area LIKE '-' OR Description LIKE '-' OR TOC LIKE '-' OR ORD LIKE '-' OR MOB LIKE '-' OR IA LIKE '-' OR LS LIKE '-' OR AH LIKE '-' OR MAV LIKE '-' OR CD LIKE '-'"
print(pd.read_sql(sql5,connection))

print("##################### Using Pandas ##################")
print((df_new == "-").sum())

##################### Using SQL ##################
Empty DataFrame
Columns: [date, station_area, description, toc, ord, mob, ia, ls, ah, mav, cd]
Index: []
##################### Using Pandas ##################
Date            0
Station_Area    0
Description     0
TOC             0
ORD             0
MOB             0
IA              0
LS              0
AH              0
MAV             0
CD              0
dtype: int64

In [104]:
connection.close()